# remoeve the and row and columns

remove any row and column with the help of drop() method 
drop(column = ["columns_name"] , inplace = True)

In [10]:
import pandas as pd 
data = {
"Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
"age"   : [21,23,20,18,25,26,45,22,30],   # Note: these are strings, not numbers
"salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
"work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
           'maneger','bank maneger','scientest']
}
df = pd.DataFrame(data)
print(df)
print("remove the age row  'single row':-")
df.drop(columns = ['age'], inplace = True) # only remove a single row not more 
print(df)
print("remove the work and salary row  'multi row':-")
df.drop(columns = ['work','salary'] , inplace = True)
print(df)

           Name  age  salary                  work
0          yash   21  101000          data science
1  yash vardhan   23  100000          data analyst
2         tanya   20   10000       sales executive
3         tushi   18   20000             accounted
4         mohit   25     150                swiper
5          monu   26   12000  hardware Engineering
6      shinchan   45   15000               maneger
7       nobitha   22   25000          bank maneger
8      doremone   30   30000             scientest
remove the age row  'single row':-
           Name  salary                  work
0          yash  101000          data science
1  yash vardhan  100000          data analyst
2         tanya   10000       sales executive
3         tushi   20000             accounted
4         mohit     150                swiper
5          monu   12000  hardware Engineering
6      shinchan   15000               maneger
7       nobitha   25000          bank maneger
8      doremone   30000             scientest
remove the work and salary row  'multi row':-
           Name
0          yash
1  yash vardhan
2         tanya
3         tushi
4         mohit
5          monu
6      shinchan
7       nobitha
8      doremone